app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def same_director
    id = params[:id]
    @movie = Movie.find(id)
director = @movie.director

if director and !director.empty?
      @movies = Movie.find_all_by_director(director)